# Project 3, Part 1 - IMDB Data Load, Clean

## movieStats

### Author:  Sheneka Allen

## Part 1

In [1]:
# import key libraries, tools
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote # must have for special char pwd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# connect to PyMysql
username = 'root'
password = 'pwd'

# Create connection string using credentials for special character mysql pwd

connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/movieStats"
engine = create_engine(connection)

In [3]:
# Check if database exists, if not, create it
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

The database already exists.

In [4]:
# verify movieStats db was created
database_exists(connection)

True

In [5]:
# load the three (3) official IMDB data for the requested tables
# title.basics.tsv.gz, title.ratings.tsv.gz, title.akas.tsv.gz

df = pd.read_csv('Data/title.basics.tsv.gz', compression='gzip', sep='\t', low_memory=False)

# show basics dataframe
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9023456 entries, 0 to 9023455
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 619.6+ MB

In [7]:
df.isnull().sum()

tconst             0
titleType          0
primaryTitle      11
originalTitle     11
isAdult            0
startYear          0
endYear            0
runtimeMinutes     0
genres            10
dtype: int64

In [10]:
# Exclude any movie with missing values for genres or runtime
# Decided to exclude other 22 rows of nulls, small number 

df.dropna(subset=['genres', 'primaryTitle', 'originalTitle'], inplace=True)
df.isna().sum()

tconst            0
titleType         0
primaryTitle      0
originalTitle     0
isAdult           0
startYear         0
endYear           0
runtimeMinutes    0
genres            0
dtype: int64

In [8]:
df['startYear'].value_counts().sort_values()

1885          1
1883          1
1874          1
1882          2
1889          2
         ...
2019     402245
2021     410732
2017     414044
2018     415791
\N      1199868
Name: startYear, Length: 151, dtype: int64

In [9]:
# replace all startYear strings (\N) with 0000 integer, change data type from object to int

df['startYear'] = df['startYear'].replace(r'\N', 0)
df['startYear'] = df['startYear'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9023456 entries, 0 to 9023455
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       int64
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: int64(1), object(8)
memory usage: 619.6+ MB

In [10]:
# Replace endYear \N with 0000 and change datatype from object to int
df['endYear'] = df['endYear'].replace(r'\N', 0)
df['endYear'] = df['endYear'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9023456 entries, 0 to 9023455
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       int64
 6   endYear         int64
 7   runtimeMinutes  object
 8   genres          object
dtypes: int64(2), object(7)
memory usage: 619.6+ MB

In [11]:
# list number of movie categories by titleType
df.groupby(['titleType']).size()

titleType
movie            613641
short            875943
tvEpisode       6784713
tvMiniSeries      43986
tvMovie          136564
tvPilot               2
tvSeries         227083
tvShort           10580
tvSpecial         37428
video            262061
videoGame         31455
dtype: int64

In [12]:
# Include only full-length movies (titleType = "movie").

# Modified code: https://sparkexamples.com/pandas/pandas-delete-rows-based-on-column-value
df.drop(df[df['titleType'] != 'movie'].index, inplace=True)
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
498,tt0000502,movie,Bohemios,Bohemios,0,1905,0,100,\N
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,0,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,0,90,Drama
610,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907,0,\N,Drama
625,tt0000630,movie,Hamlet,Amleto,0,1908,0,\N,Drama

In [13]:
# list number of genres categories
df.groupby(['genres']).size()

genres
Action                    14086
Action,Adult                 11
Action,Adult,Adventure        1
Action,Adult,Comedy           5
Action,Adult,Crime           10
                          ...
Thriller,Western             43
War                        1300
War,Western                  14
Western                    5122
\N                        71578
Length: 1467, dtype: int64

In [14]:
# Replace the \N value with Missing in genres column
df['genres'] = df['genres'].replace(r'\N', 'Missing')
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
498,tt0000502,movie,Bohemios,Bohemios,0,1905,0,100,Missing
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,0,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,0,90,Drama
610,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907,0,\N,Drama
625,tt0000630,movie,Hamlet,Amleto,0,1908,0,\N,Drama

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 613641 entries, 498 to 9023406
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          613641 non-null  object
 1   titleType       613641 non-null  object
 2   primaryTitle    613641 non-null  object
 3   originalTitle   613641 non-null  object
 4   isAdult         613641 non-null  object
 5   startYear       613641 non-null  object
 6   endYear         613641 non-null  object
 7   runtimeMinutes  613641 non-null  object
 8   genres          613641 non-null  object
dtypes: object(9)
memory usage: 46.8+ MB

In [15]:
df['runtimeMinutes'].value_counts().sort_values()

990          1
334          1
286          1
1151         1
549          1
         ...
85       10858
60       11162
80       11579
90       25961
\N      226809
Name: runtimeMinutes, Length: 491, dtype: int64

In [23]:
# replace Missing with 0, change datatype to int
df['runtimeMinutes'] = df['runtimeMinutes'].replace('Missing', 0)

In [24]:
df['runtimeMinutes'] = df['runtimeMinutes'].replace(r'\N', 0)
df['runtimeMinutes'] = df['runtimeMinutes'].astype(int)
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
498,tt0000502,movie,Bohemios,Bohemios,0,1905,0,100,Missing
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,0,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,0,90,Drama
610,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907,0,0,Drama
625,tt0000630,movie,Hamlet,Amleto,0,1908,0,0,Drama

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 613641 entries, 498 to 9023406
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          613641 non-null  object
 1   titleType       613641 non-null  object
 2   primaryTitle    613641 non-null  object
 3   originalTitle   613641 non-null  object
 4   isAdult         613641 non-null  object
 5   startYear       613641 non-null  int64
 6   endYear         613641 non-null  int64
 7   runtimeMinutes  613641 non-null  int64
 8   genres          613641 non-null  object
dtypes: int64(3), object(6)
memory usage: 46.8+ MB

In [26]:
df['tconst'].value_counts().sort_values()

tt0000502    1
tt0000879    1
tt0001495    1
tt0000869    1
tt0000591    1
            ..
tt9916428    1
tt9916538    1
tt9916620    1
tt9916680    1
tt9916754    1
Name: tconst, Length: 613641, dtype: int64

In [27]:
df['primaryTitle'].value_counts().sort_values()

A csavargó                     1
Goodbye Charlie                1
Freddy, Tiere, Sensationen     1
High Infidelity                1
A Distant Trumpet              1
                              ..
Hamlet                        45
Alone                         48
Mother                        48
Broken                        50
Home                          53
Name: primaryTitle, Length: 530987, dtype: int64

In [28]:
df['originalTitle'].value_counts().sort_values()

Se nos armó la gorda            1
L'ultima preda del vampiro      1
Un clair de lune à Maubeuge     1
Un coeur gros comme ça          1
Un singe en hiver               1
                               ..
Hamlet                         41
Trapped                        42
Untitled                       46
Broken                         49
Home                           49
Name: originalTitle, Length: 542236, dtype: int64

In [29]:
df['isAdult'].value_counts().sort_values()

1      9460
0    604181
Name: isAdult, dtype: int64

In [30]:
# Include only fictional movies (not from documentary genre)

df = df[df.genres != 'Documentary']
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
498,tt0000502,movie,Bohemios,Bohemios,0,1905,0,100,Missing
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,0,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,0,90,Drama
610,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907,0,0,Drama
625,tt0000630,movie,Hamlet,Amleto,0,1908,0,0,Drama

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 526319 entries, 498 to 9023396
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          526319 non-null  object
 1   titleType       526319 non-null  object
 2   primaryTitle    526319 non-null  object
 3   originalTitle   526319 non-null  object
 4   isAdult         526319 non-null  object
 5   startYear       526319 non-null  int64
 6   endYear         526319 non-null  int64
 7   runtimeMinutes  526319 non-null  int64
 8   genres          526319 non-null  object
dtypes: int64(3), object(6)
memory usage: 40.2+ MB

In [32]:
# list number of endYear values
df.groupby(['endYear']).size()

endYear
0    526319
dtype: int64

In [38]:
# Include only movies that were released 2000 - 2021 (include 2000 and 2021)

df = df[(df['startYear'] > 1999) & (df['startYear'] < 2022)]
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
11636,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,0,0,"Action,Crime"
15179,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,0,60,Missing
34805,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0,118,"Comedy,Fantasy,Romance"
61119,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,0,70,Drama
67672,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,0,122,Drama

basics dataframe reduced by about 100K rows

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 205530 entries, 11636 to 9023396
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          205530 non-null  object
 1   titleType       205530 non-null  object
 2   primaryTitle    205530 non-null  object
 3   originalTitle   205530 non-null  object
 4   isAdult         205530 non-null  object
 5   startYear       205530 non-null  int64
 6   endYear         205530 non-null  int64
 7   runtimeMinutes  205530 non-null  int64
 8   genres          205530 non-null  object
dtypes: int64(3), object(6)
memory usage: 15.7+ MB

In [41]:
# show ratings dataframe
df1 = pd.read_csv('Data/title.ratings.tsv.gz', compression='gzip', sep='\t', low_memory=False)
df1.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1892
1  tt0000002            5.9       252
2  tt0000003            6.5      1685
3  tt0000004            5.7       165
4  tt0000005            6.2      2499

In [42]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1250153 entries, 0 to 1250152
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1250153 non-null  object
 1   averageRating  1250153 non-null  float64
 2   numVotes       1250153 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.6+ MB

In [43]:
df1.isnull().sum()

tconst           0
averageRating    0
numVotes         0
dtype: int64

In [44]:
df1['tconst'].value_counts().sort_values()

tt0000001    1
tt0000007    1
tt0000008    1
tt0000009    1
tt0000010    1
            ..
tt9916428    1
tt9916406    1
tt9916160    1
tt9916720    1
tt9916778    1
Name: tconst, Length: 1250153, dtype: int64

In [45]:
df1['averageRating'].value_counts().sort_values()

1.3      262
1.1      321
1.5      326
1.4      410
1.7      432
       ...
7.0    42797
7.8    43571
7.6    43909
7.4    44374
7.2    45606
Name: averageRating, Length: 91, dtype: int64

In [46]:
df1['numVotes'].value_counts().sort_values()

453012        1
47980         1
71843         1
55058         1
21375         1
          ...
10        44091
9         48683
8         55035
6         55953
7         57648
Name: numVotes, Length: 20354, dtype: int64

In [57]:
# show akas dataframe
df2 = pd.read_csv('Data/title.akas.tsv.gz', compression='gzip', sep='\t', low_memory=False)
df2.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

In [58]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32428306 entries, 0 to 32428305
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 1.9+ GB

In [59]:
# explore syntax that represents United States region
df2.groupby(['region']).size()

region
AD           48
AE        13288
AF          251
AG           20
AI            5
         ...
ZA         8870
ZM           55
ZRCD          6
ZW          134
\N      1929670
Length: 247, dtype: int64

In [60]:
df2 = df2.loc[df2['region'] == 'US']
df2.tail(10)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
32427534,tt9916348,1,Ancient World Exposed,US,\N,imdbDisplay,\N,0
32427548,tt9916362,18,Coven,US,\N,imdbDisplay,\N,0
32427638,tt9916428,3,The Secret of China,US,\N,imdbDisplay,\N,0
32427816,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,\N,imdbDisplay,\N,0
32427886,tt9916620,1,The Copeland Case,US,\N,imdbDisplay,\N,0
32427977,tt9916702,1,Loving London: The Playground,US,\N,imdbDisplay,\N,0
32428015,tt9916720,10,The Demonic Nun,US,\N,tv,\N,0
32428017,tt9916720,12,The Nun 2,US,\N,imdbDisplay,\N,0
32428034,tt9916756,1,Pretty Pretty Black Girl,US,\N,imdbDisplay,\N,0
32428050,tt9916764,1,38,US,\N,imdbDisplay,\N,0

In [61]:
df2 = df2.replace(r'\N', 'Missing')

In [62]:
df2.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,Missing,imdbDisplay,Missing,0
14,tt0000002,7,The Clown and His Dogs,US,Missing,Missing,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,Missing,imdbDisplay,Missing,0
36,tt0000005,1,Blacksmithing Scene,US,Missing,alternative,Missing,0
41,tt0000005,6,Blacksmith Scene #1,US,Missing,alternative,Missing,0

In [56]:
## Saving filtered file as csv.gz and immediately loading (to verify)
df2.to_csv('Data/title_akas_cleaned.csv.gz',compression='gzip',index=False)
df2 = pd.read_csv('Data/title_akas_cleaned.csv.gz', low_memory=False)
df2.info()
df2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1330685 entries, 0 to 1330684
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1330685 non-null  object
 1   ordering         1330685 non-null  int64
 2   title            1330685 non-null  object
 3   region           1330685 non-null  object
 4   language         1330685 non-null  object
 5   types            1330685 non-null  object
 6   attributes       1330685 non-null  object
 7   isOriginalTitle  1330685 non-null  object
dtypes: int64(1), object(7)
memory usage: 81.2+ MB

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,Missing,imdbDisplay,Missing,0
1,tt0000002,7,The Clown and His Dogs,US,Missing,Missing,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,Missing,imdbDisplay,Missing,0
3,tt0000005,1,Blacksmithing Scene,US,Missing,alternative,Missing,0
4,tt0000005,6,Blacksmith Scene #1,US,Missing,alternative,Missing,0

In [63]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1330685 entries, 5 to 32428050
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1330685 non-null  object
 1   ordering         1330685 non-null  int64
 2   title            1330685 non-null  object
 3   region           1330685 non-null  object
 4   language         1330685 non-null  object
 5   types            1330685 non-null  object
 6   attributes       1330685 non-null  object
 7   isOriginalTitle  1330685 non-null  object
dtypes: int64(1), object(7)
memory usage: 91.4+ MB

In [64]:
## Saving filtered file as csv.gz and immediately loading (to verify)
df.to_csv('Data/title_basics_cleaned.csv.gz',compression='gzip',index=False)
df = pd.read_csv('Data/title_basics_cleaned.csv.gz')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205530 entries, 0 to 205529
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          205530 non-null  object
 1   titleType       205530 non-null  object
 2   primaryTitle    205530 non-null  object
 3   originalTitle   205530 non-null  object
 4   isAdult         205530 non-null  int64
 5   startYear       205530 non-null  int64
 6   endYear         205530 non-null  int64
 7   runtimeMinutes  205530 non-null  int64
 8   genres          205530 non-null  object
dtypes: int64(4), object(5)
memory usage: 14.1+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,0,0,"Action,Crime"
1,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,0,60,Missing
2,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0,118,"Comedy,Fantasy,Romance"
3,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,0,70,Drama
4,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,0,122,Drama

In [65]:
## Saving filtered file as csv.gz and immediately loading (to verify)
df1.to_csv('Data/title_ratings_cleaned.csv.gz',compression='gzip',index=False)
df1 = pd.read_csv('Data/title_ratings_cleaned.csv.gz')
df1.info()
df1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1250153 entries, 0 to 1250152
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1250153 non-null  object
 1   averageRating  1250153 non-null  float64
 2   numVotes       1250153 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.6+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1892
1  tt0000002            5.9       252
2  tt0000003            6.5      1685
3  tt0000004            5.7       165
4  tt0000005            6.2      2499